asafteirobert/matter-air-purifier/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Disable STA for ESP32C6
CONFIG_ENABLE_WIFI_STATION=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# Output to USB Uart + debug cli(enable only for debug)
# CONFIG_ESP_CONSOLE_UART_DEFAULT=n
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_UART_NUM=-1
# CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=3
# CONFIG_OPENTHREAD_CONSOLE_TYPE_USB_SERIAL_JTAG=y
# CONFIG_APPTRACE_DEST_UART0=n
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=n
# CONFIG_OPENTHREAD_CONSOLE_TYPE_UART=n
# CONFIG_OPENTHREAD_CLI=y
# CONFIG_ENABLE_CHIP_SHELL=y

# Disable console output (free GPIO16, GPIO17)
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_OPENTHREAD_CONSOLE_TYPE_UART=n
CONFIG_OPENTHREAD_CLI=n
CONFIG_ENABLE_CHIP_SHELL=n



# OTA
# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_CHIP_OTA_IMAGE_BUILD=y
CONFIG_DEVICE_SOFTWARE_VERSION="1.2"
CONFIG_DEVICE_SOFTWARE_VERSION_NUMBER=3